"""
要求：
    打印三级菜单如：省，市，县，可以自由发挥
    可返回上一级
    可随时退出程序

实现效果如下：

==================欢迎来到全国省市区查询系统===================
----------------------省查询菜单-----------------------
编号:1     名称:河南
编号:2     名称:湖南
编号:3     名称:广东
(查询请输入编号,b返回,q退出)>>:1
----------------------市查询菜单-----------------------
编号:1     名称:郑州
编号:2     名称:开封
编号:3     名称:南阳
编号:4     名称:洛阳
(查询请输入编号,b返回,q退出)>>:2
---------------------县/区查询菜单----------------------
编号:1     名称:鼓楼区
编号:2     名称:龙亭区
编号:3     名称:禹王台区
编号:4     名称:金明区
编号:5     名称:开封县
编号:6     名称:尉氏县
编号:7     名称:兰考县
编号:8     名称:杞县
编号:9     名称:通许县
(查询请输入编号,b返回,q退出)>>:b
----------------------市查询菜单-----------------------
编号:1     名称:郑州
编号:2     名称:开封
编号:3     名称:南阳
编号:4     名称:洛阳
(查询请输入编号,b返回,q退出)>>:q

Process finished with exit code 0

"""

menu = {
    "河南": {
            "郑州": {
                "中原区":{},
                "金水区":{},
                "二七区":{},
                "上街区":{},
                "巩义市":{},
                "新郑市":{},
                "新密市":{},
                "登封市":{},
                "荥阳市":{},
                "中牟县":{}
            }
            ,
            "开封": {
                "鼓楼区":{},
                "龙亭区":{},
                "禹王台区":{},
                "金明区":{},
                "开封县":{},
                "尉氏县":{},
                "兰考县":{},
                "杞县":{},
                "通许县":{}
            }
            ,
            "南阳": {
                "卧龙区":{},
                "宛城区":{},
                "邓州市":{},
                "桐柏县":{},
                "方城县":{},
                "淅川县":{},
                "镇平县":{},
                "唐河县":{},
                "南召县":{},
                "内乡县":{}
            }
            ,
            "洛阳": {
                "西工区":{},
                "老城区":{},
                "涧西区":{},
                "瀍河回族区":{},
                "洛龙区":{},
                "吉利区":{},
                "偃师市":{},
                "孟津县":{},
                "汝阳县":{}
            }
    },
    "湖南": {
            "长沙": {
                "岳麓区":{},
                "芙蓉区":{},
                "天心区":{},
                "开福区":{},
                "雨花区":{},
                "浏阳市":{},
                "长沙县":{}
            }
            ,
            "岳阳": {
                "岳阳楼区":{},
                "云溪区":{},
                "君山区":{},
                "临湘市":{},
                "汨罗市":{},
                "岳阳县":{}
            }
            ,
            "株洲": {
                "天元区":{},
                "荷塘区":{},
                "芦淞区":{},
                "石峰区":{},
                "醴陵市":{},
                "株洲县":{},
                "炎陵县":{}
            }
            ,
            "湘潭": {
                "岳塘区":{},
                "雨湖区":{},
                "湘乡市":{},
                "韶山市":{},
                "湘潭县":{}
            }
    },
    "广东": {
            "广州": {
                "越秀区":{},
                "荔湾区":{},
                "海珠区":{},
                "天河区":{},
                "白云区":{},
                "黄埔区":{},
                "番禺区":{},
                "花都区":{}
            }
            ,
            "深圳": {
                "福田区":{},
                "罗湖区":{},
                "南山区":{},
                "宝安区":{},
                "龙岗区":{},
                "盐田区":{}
            }
            ,
            "珠海": {
                "香洲区":{},
                "斗门区":{},
                "金湾区":{}
            }
    }
}

layers = [menu]


print('欢迎来到全国省市区查询系统'.center(50, '='))
while True:
    if len(layers) == 0: break

    current_layer = layers[-1]
    d = {}  # 存储编号和对应名称

    if len(layers) == 1:
        print("省查询菜单".center(50, '-'))
    if len(layers) == 2:
        print("市查询菜单".center(50, '-'))
    if len(layers) == 3:
        print("县/区查询菜单".center(50, '-'))

    for i, k in zip(range(len(current_layer)), current_layer):
        print("编号:{}{}名称:{}".format(i+1, ' '*5, k))
        d[i+1] = k

    choice = input("(查询请输入编号,b返回,q退出)>>:").strip()

    if choice == 'q':break

    if choice == 'b':
        layers.pop(-1)
        continue

    try:
        choice = d[eval(choice)]
        layers.append(current_layer[choice])
    except:
        continue


