"""
# 要求：
    打印三级菜单如：省，市，县，可以自由发挥
    可返回上一级
    可随时退出程序
"""

"""
# 实现效果如下：

欢迎来到全国省市区查询系统...
+---------------------------------------------------------------+
省的编号:1          省的名称：湖南
省的编号:2          省的名称：河南
省的编号:3          省的名称：广东
+---------------------------------------------------------------+
请输入你要查询的省的编号(输入quit退出)：3
广东
+---------------------------------------------------------------+
市的编号：1        市的名称：广州
市的编号：2        市的名称：深圳
市的编号：3        市的名称：珠海
+---------------------------------------------------------------+
请输入你要查询的市的编号(输入quit退出,输入back返回上一层)：2
广东    深圳
+---------------------------------------------------------------+
县/区编号：1        县/区名称：福田区
县/区编号：2        县/区名称：罗湖区
县/区编号：3        县/区名称：南山区
县/区编号：4        县/区名称：宝安区
县/区编号：5        县/区名称：龙岗区
县/区编号：6        县/区名称：盐田区
+---------------------------------------------------------------+
请输入你要查询的县/区的编号(输入quit退出,输入back返回上一层)：back
+---------------------------------------------------------------+
市的编号：1        市的名称：广州
市的编号：2        市的名称：深圳
市的编号：3        市的名称：珠海
+---------------------------------------------------------------+
请输入你要查询的市的编号(输入quit退出,输入back返回上一层)：quit
"""


ict_db = {
    "河南": [
        {
            "郑州": [
                "中原区",
                "金水区",
                "二七区",
                "上街区",
                "巩义市",
                "新郑市",
                "新密市",
                "登封市",
                "荥阳市",
                "中牟县"
            ]
        },
        {
            "开封": [
                "鼓楼区",
                "龙亭区",
                "禹王台区",
                "金明区",
                "开封县",
                "尉氏县",
                "兰考县",
                "杞县",
                "通许县"
            ]
        },
        {
            "南阳": [
                "卧龙区",
                "宛城区",
                "邓州市",
                "桐柏县",
                "方城县",
                "淅川县",
                "镇平县",
                "唐河县",
                "南召县",
                "内乡县"
            ]
        },
        {
            "洛阳": [
                "西工区",
                "老城区",
                "涧西区",
                "瀍河回族区",
                "洛龙区",
                "吉利区",
                "偃师市",
                "孟津县",
                "汝阳县"
            ]
        }
    ],
    "湖南": [
        {
            "长沙": [
                "岳麓区",
                "芙蓉区",
                "天心区",
                "开福区",
                "雨花区",
                "浏阳市",
                "长沙县"
            ]
        },
        {
            "岳阳": [
                "岳阳楼区",
                "云溪区",
                "君山区",
                "临湘市",
                "汨罗市",
                "岳阳县"
            ]
        },
        {
            "株洲": [
                "天元区",
                "荷塘区",
                "芦淞区",
                "石峰区",
                "醴陵市",
                "株洲县",
                "炎陵县"
            ]
        },
        {
            "湘潭": [
                "岳塘区",
                "雨湖区",
                "湘乡市",
                "韶山市",
                "湘潭县"
            ]
        }
    ],
    "广东": [
        {
            "广州": [
                "越秀区",
                "荔湾区",
                "海珠区",
                "天河区",
                "白云区",
                "黄埔区",
                "番禺区",
                "花都区"
            ]
        },
        {
            "深圳": [
                "福田区",
                "罗湖区",
                "南山区",
                "宝安区",
                "龙岗区",
                "盐田区"
            ]
        },
        {
            "珠海": [
                "香洲区",
                "斗门区",
                "金湾区"
            ]
        }
    ]
}


def show_province(keys):
    print("+{}+".format('-'*50))
    for i in range(len(keys)):
        print("省的编号:{}    省的名称：{}".format(i+1, keys[i]))
    print("+{}+".format('-'*50))


def show_city(d, province):
    print("+{}+".format('-'*50))
    for i in range(len(d[province])):
        print("市的编号:{}    市的名称:{}".format(i+1, list(d[province][i].keys())[0]))
    print("+{}+".format('-'*50))


def show_town(d, num, province):
    print("+{}+".format('-'*50))
    for i in range(len(list(d[province][num-1].values())[0])):
        print("县/区编号:{}   县/区名称:{}".format(i+1, list(d[province][num-1].values())[0][i]))
    print("+{}+".format('-'*50))


print("欢迎来到全国省市区查询系统...")
province_keys = list(ict_db.keys())
show_province(province_keys)
while True:
    num_c = 'back'
    num_t = 'back'
    while num_c == 'back':
        num_p = input("请输入你要查询的省的编号(输入quit退出)：")
        if num_p == 'quit':
            break
        province = province_keys[eval(num_p)-1]
        print(province)
        show_city(ict_db, province)
        while num_t == 'back':
            num_c = input("请输入你要查询的市的编号(输入quit退出, 输入back返回上一层)：")
            if num_c == 'quit' or num_c == 'back':
                break
            city = list(ict_db[province][eval(num_c) - 1].keys())[0]
            print(province, city)
            show_town(ict_db, eval(num_c), province)
            num_t = input("请输入你要查询的县/区的编号(输入quit退出,输入back返回上一层)")
            if num_t == 'quit':
                break
        if num_c == 'quit' or num_t == 'quit':
            break
    if num_p == 'quit' or num_c == 'quit' or num_t == 'quit':
        break
    town = list(ict_db[province][eval(num_c) - 1].values())[0][eval(num_t) - 1]
    print(province, city, town)

